In [5]:
import pandas as pd
import numpy as np

dados = pd.read_csv('StudentsPerformance.csv')

In [ ]:
# Verificar as cinco primeiras linhas
dados.head()

In [ ]:
# Verifica as cinco ultimas linhas
dados.tail()

In [ ]:
#Verifica a quantidade de linhas e colunas
dados.shape

In [ ]:
# Verifica todas as colunas em forma de objeto
dados.columns

In [ ]:
# Verifica as linhas duplicadas
dados.duplicated().sum()

In [ ]:
# Verifica as informações de armazenamento de dados das colunas
dados.info()

In [ ]:
# Verifica a existencia de valores NaN 
dados.isna().sum()

In [ ]:
# Sumario estatico
dados.describe()

In [30]:
# Verifica a quantidade de valores únicos em cada coluna
dados.nunique()

gender                          2
race/ethnicity                  5
parental level of education     6
lunch                           2
test preparation course         2
math score                     81
reading score                  72
writing score                  77
dtype: int64

In [ ]:
# Veirifica quais saão os valores unicos da caluna
dados['race/ethnicity'].unique()

In [ ]:
# Verifica a quatidade dos valores repetidaos da coluna
dados['parental level of education'].value_counts()

In [35]:
# Ordenar o dataset
columns = ['math score', 'reading score', 'writing score']

dados = dados.sort_values(by = columns, ascending=False).reset_index(drop = True)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group E,bachelor's degree,standard,none,100,100,100
1,male,group E,bachelor's degree,standard,completed,100,100,100
2,female,group E,associate's degree,standard,none,100,100,100
3,male,group E,associate's degree,free/reduced,completed,100,100,93
4,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
995,female,group C,some college,free/reduced,none,22,39,33
996,female,group B,some college,standard,none,19,38,32
997,female,group B,some high school,free/reduced,none,18,32,28
998,female,group B,high school,free/reduced,none,8,24,23
999,female,group C,some high school,free/reduced,none,0,17,10

In [37]:
dados['Media'] = dados[columns].mean(axis=1)

dados.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Media
0,female,group E,bachelor's degree,standard,none,100,100,100,100.000000
1,male,group E,bachelor's degree,standard,completed,100,100,100,100.000000
2,female,group E,associate's degree,standard,none,100,100,100,100.000000
3,male,group E,associate's degree,free/reduced,completed,100,100,93,97.666667
4,male,group D,some college,standard,completed,100,97,99,98.666667